// Даны 2 числа. Показать большее и меньшее число

int a=5, b=10;
if (a>b) Console.WriteLine("a > b");
if (a<b) Console.WriteLine("a < b");
if (a==b) Console.WriteLine("a = b");
